{
 "array_types" :
 [
  {
   "alignment" : 1,
   "linker_set_key" : "char [0]",
   "name" : "char [0]",
   "referenced_type" : "type-8",
   "self_type" : "type-9",
   "source_file" : "/home/abhishek/aosp-q1/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [5121]",
   "name" : "unsigned char [5121]",
   "referenced_type" : "type-15",
   "self_type" : "type-16",
   "size" : 5121,
   "source_file" : "/home/abhishek/aosp-q1/system/core/liblog/include/log/log_read.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "int [0]",
   "name" : "int [0]",
   "referenced_type" : "type-7",
   "self_type" : "type-26",
   "source_file" : "/home/abhishek/aosp-q1/system/core/libcutils/include/cutils/native_handle.h"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "unsigned char [32]",
   "name" : "unsigned char [32]",
   "referenced_type" : "type-15",
   "self_type" : "type-349",
   "size" : 32,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlSupport.h"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "unsigned int [8]",
   "name" : "unsigned int [8]",
   "referenced_type" : "type-2",
   "self_type" : "type-466",
   "size" : 32,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libsystem/include/system/graphics.h"
  },
  {
   "linker_set_key" : "float []",
   "name" : "float []",
   "referenced_type" : "type-276",
   "self_type" : "type-473",

   "name" : "const android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, bool>",
   "referenced_type" : "type-425",
   "self_type" : "type-427",
   "size" : 16,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/transport/include/hidl/ConcurrentMap.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::hidl::base::V1_0::IBase *const",
   "name" : "const android::hidl::base::V1_0::IBase *const",
   "referenced_type" : "type-137",
   "self_type" : "type-432",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/transport/include/hidl/ConcurrentMap.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::VectorImpl",
   "name" : "const android::VectorImpl",
   "referenced_type" : "type-445",
   "self_type" : "type-446",
   "size" : 20,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/VectorImpl.h"
  },
  {
   "alignment" : 1,
   "is_volatile" : true,
   "linker_set_key" : "volatile bool",
   "name" : "volatile bool",
   "referenced_type" : "type-17",
   "self_type" : "type-498",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/Thread.h"
  },
  {
   "alignment" : 4,
   "is_volatile" : true,
   "linker_set_key" : "volatile int",
   "name" : "volatile int",
   "referenced_type" : "type-7",
   "self_type" : "type-501",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/libhwbinder/include/hwbinder/ProcessState.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::hidl::manager::V1_0::IServiceNotification",
   "name" : "const android::hidl::manager::V1_0::IServiceNotification",
   "referenced_type" : "type-166",
   "self_type" : "type-505",
   "size" : 12,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceNotification.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const android::hidl::manager::V1_0::IServiceManager::Transport",
   "name" : "const android::hidl::manager::V1_0::IServiceManager::Transport",
   "referenced_type" : "type-507",
   "self_type" : "type-510",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceManager.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::hidl::manager::V1_0::IServiceManager::PidConstant",
   "name" : "const android::hidl::manager::V1_0::IServiceManager::PidConstant",
   "referenced_type" : "type-508",
   "self_type" : "type-512",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceManager.h"
  },
  {
   "alignment" : 1,
   "is_const" : true,
   "linker_set_key" : "const std::array<android::hidl::manager::V1_0::IServiceManager::Transport, 3>",
   "name" : "const std::array<android::hidl::manager::V1_0::IServiceManager::Transport, 3>",
   "referenced_type" : "type-513",
   "self_type" : "type-514",
   "size" : 3,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceManager.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const std::array<android::hidl::manager::V1_0::IServiceManager::PidConstant, 1>",
   "name" : "const std::array<android::hidl::manager::V1_0::IServiceManager::PidConstant, 1>",
   "referenced_type" : "type-515",
   "self_type" : "type-516",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceManager.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::hardware::foobar::V1_0::IFoobar",
   "name" : "const android::hardware::foobar::V1_0::IFoobar",
   "referenced_type" : "type-90",
   "self_type" : "type-517",
   "size" : 12,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/hardware/interfaces/foobar/1.0/android.hardware.foobar@1.0_genc++_headers/gen/android/hardware/foobar/1.0/IFoobar.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::hardware::hidl_vec<android::hardware::hidl_string>",
   "name" : "const android::hardware::hidl_vec<android::hardware::hidl_string>",
   "referenced_type" : "type-333",
   "self_type" : "type-520",
   "size" : 16,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/hardware/interfaces/foobar/1.0/android.hardware.foobar@1.0_genc++_headers/gen/android/hardware/foobar/1.0/IFoobar.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::hidl::base::V1_0::BpHwBase",
   "name" : "const android::hidl::base::V1_0::BpHwBase",
   "referenced_type" : "type-526",
   "self_type" : "type-528",
   "size" : 92,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/BpHwBase.h"
  },
  {
   "alignment" : 4,
   "is_const" : true,
   "linker_set_key" : "const android::hardware::foobar::V1_0::BpHwFoobar",
   "name" : "const android::hardware::foobar::V1_0::BpHwFoobar",
   "referenced_type" : "type-132",
   "self_type" : "type-530",
   "size" : 92,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/hardware/interfaces/foobar/1.0/android.hardware.foobar@1.0_genc++_headers/gen/android/hardware/foobar/1.0/BpHwFoobar.h"
  }
 ],
 "record_types" :
 [
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "tv_sec",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "tv_nsec",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "log_time",
   "name" : "log_time",
   "referenced_type" : "type-4",
   "self_type" : "type-4",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/core/liblog/include_vndk/log/log_time.h",
   "unique_id" : "_ZTS8log_time"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "__pad",
     "field_offset" : 16,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "msg",
     "field_offset" : 160,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "logger_entry",
   "name" : "logger_entry",
   "referenced_type" : "type-5",
   "self_type" : "type-5",
   "size" : 20,
   "source_file" : "/home/abhishek/aosp-q1/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "euid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "logger_entry_v2",
   "name" : "logger_entry_v2",
   "referenced_type" : "type-10",
   "self_type" : "type-10",
   "size" : 24,
   "source_file" : "/home/abhishek/aosp-q1/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v2"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 192,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "logger_entry_v3",
   "name" : "logger_entry_v3",
   "referenced_type" : "type-11",
   "self_type" : "type-11",
   "size" : 24,
   "source_file" : "/home/abhishek/aosp-q1/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v3"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "len",
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "hdr_size",
     "field_offset" : 16,
     "referenced_type" : "type-6"
    },
    {
     "field_name" : "pid",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "tid",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "sec",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "nsec",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "lid",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "uid",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "msg",
     "field_offset" : 224,
     "referenced_type" : "type-9"
    }
   ],
   "linker_set_key" : "logger_entry_v4",
   "name" : "logger_entry_v4",
   "referenced_type" : "type-12",
   "self_type" : "type-12",
   "size" : 28,
   "source_file" : "/home/abhishek/aosp-q1/system/core/liblog/include/log/log_read.h",
   "unique_id" : "logger_entry_v4"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "buf",
     "referenced_type" : "type-16"
    },
    {
     "field_name" : "entry",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "entry_v4",
     "referenced_type" : "type-12"
    },
    {
     "field_name" : "entry_v3",
     "referenced_type" : "type-11"
    },
    {
     "field_name" : "entry_v2",
     "referenced_type" : "type-10"
    },
    {
     "field_name" : "entry_v1",
     "referenced_type" : "type-5"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "name" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3) at system/core/liblog/include_vndk/log/log_read.h:139:3",
   "record_kind" : "union",
   "referenced_type" : "type-14",
   "self_type" : "type-14",
   "size" : 5124,
   "source_file" : "/home/abhishek/aosp-q1/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg::(anonymous union at system/core/liblog/include_vndk/log/log_read.h:139:3)"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "referenced_type" : "type-14"
    }
   ],
   "linker_set_key" : "log_msg",
   "name" : "log_msg",
   "referenced_type" : "type-13",
   "self_type" : "type-13",
   "size" : 5124,
   "source_file" : "/home/abhishek/aosp-q1/system/core/liblog/include/log/log_read.h",
   "unique_id" : "log_msg"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "version",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "numFds",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "numInts",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "data",
     "field_offset" : 96,
     "referenced_type" : "type-26"
    }
   ],
   "linker_set_key" : "native_handle",
   "name" : "native_handle",
   "referenced_type" : "type-25",
   "self_type" : "type-25",
   "size" : 12,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libcutils/include/cutils/native_handle.h",
   "unique_id" : "native_handle"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::i_tag",
   "name" : "android::hardware::details::i_tag",
   "referenced_type" : "type-27",
   "self_type" : "type-27",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details5i_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bnhw_tag",
   "name" : "android::hardware::details::bnhw_tag",
   "referenced_type" : "type-28",
   "self_type" : "type-28",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bnhw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bphw_tag",
   "name" : "android::hardware::details::bphw_tag",
   "referenced_type" : "type-29",
   "self_type" : "type-29",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details8bphw_tagE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::bs_tag",
   "name" : "android::hardware::details::bs_tag",
   "referenced_type" : "type-30",
   "self_type" : "type-30",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details6bs_tagE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-34"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-21"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-32",
   "self_type" : "type-32",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-32"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const native_handle>",
   "name" : "android::hardware::details::hidl_pointer<const native_handle>",
   "referenced_type" : "type-31",
   "self_type" : "type-31",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-33" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIK13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-38"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-21"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<const char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-36",
   "self_type" : "type-36",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-36"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<const char>",
   "name" : "android::hardware::details::hidl_pointer<const char>",
   "referenced_type" : "type-35",
   "self_type" : "type-35",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-37" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIKcEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-42"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-21"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<GrantorDescriptor>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-40",
   "self_type" : "type-40",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-40"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-39",
   "self_type" : "type-39",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_17GrantorDescriptorEEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-45"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-21"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<native_handle>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-44",
   "self_type" : "type-44",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-44"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<native_handle>",
   "name" : "android::hardware::details::hidl_pointer<native_handle>",
   "referenced_type" : "type-43",
   "self_type" : "type-43",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-25" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerI13native_handleEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-48"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-21"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<int>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-47",
   "self_type" : "type-47",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIiEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-47"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<int>",
   "name" : "android::hardware::details::hidl_pointer<int>",
   "referenced_type" : "type-46",
   "self_type" : "type-46",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIiEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-56"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-21"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<hidl_string>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<hidl_string>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-54",
   "self_type" : "type-54",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-54"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::hidl_string>",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_string>",
   "referenced_type" : "type-53",
   "self_type" : "type-53",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-55" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_11hidl_stringEEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-66"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-21"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<hidl_array<unsigned char, 32> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<hidl_array<unsigned char, 32> >::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-64",
   "self_type" : "type-64",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIhLj32EJEEEEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-64"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<android::hardware::hidl_array<unsigned char, 32> >",
   "name" : "android::hardware::details::hidl_pointer<android::hardware::hidl_array<unsigned char, 32> >",
   "referenced_type" : "type-63",
   "self_type" : "type-63",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-65" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerINS0_10hidl_arrayIhLj32EJEEEEE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "mPointer",
     "referenced_type" : "type-23"
    },
    {
     "field_name" : "_pad",
     "referenced_type" : "type-21"
    }
   ],
   "is_anonymous" : true,
   "linker_set_key" : "android::hardware::details::hidl_pointer<char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "name" : "android::hardware::details::hidl_pointer<char>::(anonymous union at system/libhidl/base/include/hidl/HidlInternal.h:110:5) at system/libhidl/base/include/hidl/HidlInternal.h:110:5",
   "record_kind" : "union",
   "referenced_type" : "type-73",
   "self_type" : "type-73",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIcEUt_E"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-73"
    }
   ],
   "linker_set_key" : "android::hardware::details::hidl_pointer<char>",
   "name" : "android::hardware::details::hidl_pointer<char>",
   "referenced_type" : "type-72",
   "self_type" : "type-72",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android8hardware7details12hidl_pointerIcEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mInstrumentationCallbacks",
     "field_offset" : 32,
     "referenced_type" : "type-75"
    },
    {
     "access" : "protected",
     "field_name" : "mEnableInstrumentation",
     "field_offset" : 128,
     "referenced_type" : "type-17"
    },
    {
     "access" : "protected",
     "field_name" : "mInstrumentationLibPackage",
     "field_offset" : 160,
     "referenced_type" : "type-76"
    },
    {
     "access" : "protected",
     "field_name" : "mInterfaceName",
     "field_offset" : 256,
     "referenced_type" : "type-76"
    }
   ],
   "linker_set_key" : "android::hardware::details::HidlInstrumentor",
   "name" : "android::hardware::details::HidlInstrumentor",
   "referenced_type" : "type-74",
   "self_type" : "type-74",
   "size" : 44,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlInternal.h",
   "unique_id" : "_ZTSN7android8hardware7details16HidlInstrumentorE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7details16HidlInstrumentorE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7details16HidlInstrumentorD0Ev"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-83"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "type-85"
    }
   ],
   "linker_set_key" : "android::wp<android::hidl::base::V1_0::IBase>",
   "name" : "android::wp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-81",
   "self_type" : "type-81",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-82" ],
   "unique_id" : "_ZTSN7android2wpINS_4hidl4base4V1_05IBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-96"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "type-85"
    }
   ],
   "linker_set_key" : "android::wp<android::hardware::hidl_death_recipient>",
   "name" : "android::wp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "type-94",
   "self_type" : "type-94",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-95" ],
   "unique_id" : "_ZTSN7android2wpINS_8hardware20hidl_death_recipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-105"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "type-85"
    }
   ],
   "linker_set_key" : "android::wp<android::hardware::IBinder::DeathRecipient>",
   "name" : "android::wp<android::hardware::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "type-103",
   "self_type" : "type-103",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN7android2wpINS_8hardware7IBinder14DeathRecipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-113"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "type-85"
    }
   ],
   "linker_set_key" : "android::wp<android::hardware::BHwBinder>",
   "name" : "android::wp<android::hardware::BHwBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-111",
   "self_type" : "type-111",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-112" ],
   "unique_id" : "_ZTSN7android2wpINS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-122"
    },
    {
     "access" : "private",
     "field_name" : "m_refs",
     "field_offset" : 32,
     "referenced_type" : "type-85"
    }
   ],
   "linker_set_key" : "android::wp<android::hidl::manager::V1_0::IServiceManager>",
   "name" : "android::wp<android::hidl::manager::V1_0::IServiceManager>",
   "record_kind" : "class",
   "referenced_type" : "type-120",
   "self_type" : "type-120",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/RefBase.h",
   "template_args" : [ "type-121" ],
   "unique_id" : "_ZTSN7android2wpINS_4hidl7manager4V1_015IServiceManagerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-96"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::hidl_death_recipient>",
   "name" : "android::sp<android::hardware::hidl_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "type-102",
   "self_type" : "type-102",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-95" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware20hidl_death_recipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-83"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::base::V1_0::IBase>",
   "name" : "android::sp<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-126",
   "self_type" : "type-126",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-82" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl4base4V1_05IBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-105"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::IBinder::DeathRecipient>",
   "name" : "android::sp<android::hardware::IBinder::DeathRecipient>",
   "record_kind" : "class",
   "referenced_type" : "type-138",
   "self_type" : "type-138",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-104" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware7IBinder14DeathRecipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-143"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::IBinder>",
   "name" : "android::sp<android::hardware::IBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-141",
   "self_type" : "type-141",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-142" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware7IBinderEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-149"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::IInterface>",
   "name" : "android::sp<android::hardware::IInterface>",
   "record_kind" : "class",
   "referenced_type" : "type-147",
   "self_type" : "type-147",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-148" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware10IInterfaceEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-152"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::ProcessState>",
   "name" : "android::sp<android::hardware::ProcessState>",
   "record_kind" : "class",
   "referenced_type" : "type-150",
   "self_type" : "type-150",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-151" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware12ProcessStateEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-122"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::manager::V1_0::IServiceManager>",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceManager>",
   "record_kind" : "class",
   "referenced_type" : "type-156",
   "self_type" : "type-156",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-121" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl7manager4V1_015IServiceManagerEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-164"
    }
   ],
   "linker_set_key" : "android::sp<android::Thread>",
   "name" : "android::sp<android::Thread>",
   "record_kind" : "class",
   "referenced_type" : "type-162",
   "self_type" : "type-162",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-163" ],
   "unique_id" : "_ZTSN7android2spINS_6ThreadEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-167"
    }
   ],
   "linker_set_key" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "name" : "android::sp<android::hidl::manager::V1_0::IServiceNotification>",
   "record_kind" : "class",
   "referenced_type" : "type-165",
   "self_type" : "type-165",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-166" ],
   "unique_id" : "_ZTSN7android2spINS_4hidl7manager4V1_020IServiceNotificationEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-134"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::foobar::V1_0::IFoobar>",
   "name" : "android::sp<android::hardware::foobar::V1_0::IFoobar>",
   "record_kind" : "class",
   "referenced_type" : "type-89",
   "self_type" : "type-89",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-90" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware6foobar4V1_07IFoobarEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-140"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::hidl_binder_death_recipient>",
   "name" : "android::sp<android::hardware::hidl_binder_death_recipient>",
   "record_kind" : "class",
   "referenced_type" : "type-109",
   "self_type" : "type-109",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-110" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware27hidl_binder_death_recipientEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "m_ptr",
     "referenced_type" : "type-113"
    }
   ],
   "linker_set_key" : "android::sp<android::hardware::BHwBinder>",
   "name" : "android::sp<android::hardware::BHwBinder>",
   "record_kind" : "class",
   "referenced_type" : "type-179",
   "self_type" : "type-179",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/StrongPointer.h",
   "template_args" : [ "type-112" ],
   "unique_id" : "_ZTSN7android2spINS_8hardware9BHwBinderEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mException",
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mErrorCode",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mMessage",
     "field_offset" : 64,
     "referenced_type" : "type-76"
    }
   ],
   "linker_set_key" : "android::hardware::Status",
   "name" : "android::hardware::Status",
   "record_kind" : "class",
   "referenced_type" : "type-180",
   "self_type" : "type-180",
   "size" : 20,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware6StatusE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-189"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 168,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::Return<bool>",
   "name" : "android::hardware::Return<bool>",
   "record_kind" : "class",
   "referenced_type" : "type-188",
   "self_type" : "type-188",
   "size" : 24,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIbEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-189"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::Return<unsigned int>",
   "name" : "android::hardware::Return<unsigned int>",
   "record_kind" : "class",
   "referenced_type" : "type-195",
   "self_type" : "type-195",
   "size" : 28,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIjEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-189"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVal",
     "field_offset" : 192,
     "referenced_type" : "type-89"
    }
   ],
   "linker_set_key" : "android::hardware::Return<android::sp<android::hardware::foobar::V1_0::IFoobar> >",
   "name" : "android::hardware::Return<android::sp<android::hardware::foobar::V1_0::IFoobar> >",
   "record_kind" : "class",
   "referenced_type" : "type-201",
   "self_type" : "type-201",
   "size" : 28,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-89" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnINS_2spINS0_6foobar4V1_07IFoobarEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStatus",
     "referenced_type" : "type-180"
    },
    {
     "access" : "private",
     "field_name" : "mCheckedStatus",
     "field_offset" : 160,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::details::return_status",
   "name" : "android::hardware::details::return_status",
   "record_kind" : "class",
   "referenced_type" : "type-189",
   "self_type" : "type-189",
   "size" : 24,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/Status.h",
   "unique_id" : "_ZTSN7android8hardware7details13return_statusE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-189"
    }
   ],
   "linker_set_key" : "android::hardware::Return<void>",
   "name" : "android::hardware::Return<void>",
   "record_kind" : "class",
   "referenced_type" : "type-213",
   "self_type" : "type-213",
   "size" : 24,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/Status.h",
   "template_args" : [ "type-57" ],
   "unique_id" : "_ZTSN7android8hardware6ReturnIvEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-218"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::VirtualLightRefBase>",
   "name" : "android::LightRefBase<android::VirtualLightRefBase>",
   "record_kind" : "class",
   "referenced_type" : "type-217",
   "self_type" : "type-217",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-219" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_19VirtualLightRefBaseEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCount",
     "referenced_type" : "type-218"
    }
   ],
   "linker_set_key" : "android::LightRefBase<android::NativeHandle>",
   "name" : "android::LightRefBase<android::NativeHandle>",
   "record_kind" : "class",
   "referenced_type" : "type-220",
   "self_type" : "type-220",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/LightRefBase.h",
   "template_args" : [ "type-221" ],
   "unique_id" : "_ZTSN7android12LightRefBaseINS_12NativeHandleEEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-217"
    }
   ],
   "linker_set_key" : "android::VirtualLightRefBase",
   "name" : "android::VirtualLightRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-219",
   "self_type" : "type-219",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/LightRefBase.h",
   "unique_id" : "_ZTSN7android19VirtualLightRefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android19VirtualLightRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android19VirtualLightRefBaseD0Ev"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<void>",
   "name" : "android::trait_trivial_ctor<void>",
   "referenced_type" : "type-223",
   "self_type" : "type-223",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-57" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<void>",
   "name" : "android::trait_trivial_dtor<void>",
   "referenced_type" : "type-224",
   "self_type" : "type-224",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-57" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<void>",
   "name" : "android::trait_trivial_copy<void>",
   "referenced_type" : "type-225",
   "self_type" : "type-225",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-57" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<void>",
   "name" : "android::trait_trivial_move<void>",
   "referenced_type" : "type-226",
   "self_type" : "type-226",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-57" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIvEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<bool>",
   "name" : "android::trait_trivial_ctor<bool>",
   "referenced_type" : "type-227",
   "self_type" : "type-227",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<bool>",
   "name" : "android::trait_trivial_dtor<bool>",
   "referenced_type" : "type-228",
   "self_type" : "type-228",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<bool>",
   "name" : "android::trait_trivial_copy<bool>",
   "referenced_type" : "type-229",
   "self_type" : "type-229",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<bool>",
   "name" : "android::trait_trivial_move<bool>",
   "referenced_type" : "type-230",
   "self_type" : "type-230",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-17" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIbEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<char>",
   "name" : "android::trait_trivial_ctor<char>",
   "referenced_type" : "type-231",
   "self_type" : "type-231",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<char>",
   "name" : "android::trait_trivial_dtor<char>",
   "referenced_type" : "type-232",
   "self_type" : "type-232",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<char>",
   "name" : "android::trait_trivial_copy<char>",
   "referenced_type" : "type-233",
   "self_type" : "type-233",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<char>",
   "name" : "android::trait_trivial_move<char>",
   "referenced_type" : "type-234",
   "self_type" : "type-234",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned char>",
   "name" : "android::trait_trivial_ctor<unsigned char>",
   "referenced_type" : "type-235",
   "self_type" : "type-235",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned char>",
   "name" : "android::trait_trivial_dtor<unsigned char>",
   "referenced_type" : "type-236",
   "self_type" : "type-236",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned char>",
   "name" : "android::trait_trivial_copy<unsigned char>",
   "referenced_type" : "type-237",
   "self_type" : "type-237",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned char>",
   "name" : "android::trait_trivial_move<unsigned char>",
   "referenced_type" : "type-238",
   "self_type" : "type-238",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIhEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<short>",
   "name" : "android::trait_trivial_ctor<short>",
   "referenced_type" : "type-239",
   "self_type" : "type-239",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-240" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<short>",
   "name" : "android::trait_trivial_dtor<short>",
   "referenced_type" : "type-241",
   "self_type" : "type-241",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-240" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<short>",
   "name" : "android::trait_trivial_copy<short>",
   "referenced_type" : "type-242",
   "self_type" : "type-242",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-240" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<short>",
   "name" : "android::trait_trivial_move<short>",
   "referenced_type" : "type-243",
   "self_type" : "type-243",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-240" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIsEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned short>",
   "name" : "android::trait_trivial_ctor<unsigned short>",
   "referenced_type" : "type-244",
   "self_type" : "type-244",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned short>",
   "name" : "android::trait_trivial_dtor<unsigned short>",
   "referenced_type" : "type-245",
   "self_type" : "type-245",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned short>",
   "name" : "android::trait_trivial_copy<unsigned short>",
   "referenced_type" : "type-246",
   "self_type" : "type-246",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned short>",
   "name" : "android::trait_trivial_move<unsigned short>",
   "referenced_type" : "type-247",
   "self_type" : "type-247",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-6" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveItEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<int>",
   "name" : "android::trait_trivial_ctor<int>",
   "referenced_type" : "type-248",
   "self_type" : "type-248",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<int>",
   "name" : "android::trait_trivial_dtor<int>",
   "referenced_type" : "type-249",
   "self_type" : "type-249",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<int>",
   "name" : "android::trait_trivial_copy<int>",
   "referenced_type" : "type-250",
   "self_type" : "type-250",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<int>",
   "name" : "android::trait_trivial_move<int>",
   "referenced_type" : "type-251",
   "self_type" : "type-251",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIiEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned int>",
   "name" : "android::trait_trivial_ctor<unsigned int>",
   "referenced_type" : "type-252",
   "self_type" : "type-252",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned int>",
   "name" : "android::trait_trivial_dtor<unsigned int>",
   "referenced_type" : "type-253",
   "self_type" : "type-253",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned int>",
   "name" : "android::trait_trivial_copy<unsigned int>",
   "referenced_type" : "type-254",
   "self_type" : "type-254",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned int>",
   "name" : "android::trait_trivial_move<unsigned int>",
   "referenced_type" : "type-255",
   "self_type" : "type-255",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-2" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIjEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long>",
   "name" : "android::trait_trivial_ctor<long>",
   "referenced_type" : "type-256",
   "self_type" : "type-256",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-257" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long>",
   "name" : "android::trait_trivial_dtor<long>",
   "referenced_type" : "type-258",
   "self_type" : "type-258",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-257" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long>",
   "name" : "android::trait_trivial_copy<long>",
   "referenced_type" : "type-259",
   "self_type" : "type-259",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-257" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long>",
   "name" : "android::trait_trivial_move<long>",
   "referenced_type" : "type-260",
   "self_type" : "type-260",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-257" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIlEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long>",
   "name" : "android::trait_trivial_ctor<unsigned long>",
   "referenced_type" : "type-261",
   "self_type" : "type-261",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-262" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long>",
   "name" : "android::trait_trivial_dtor<unsigned long>",
   "referenced_type" : "type-263",
   "self_type" : "type-263",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-262" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long>",
   "name" : "android::trait_trivial_copy<unsigned long>",
   "referenced_type" : "type-264",
   "self_type" : "type-264",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-262" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long>",
   "name" : "android::trait_trivial_move<unsigned long>",
   "referenced_type" : "type-265",
   "self_type" : "type-265",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-262" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveImEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<long long>",
   "name" : "android::trait_trivial_ctor<long long>",
   "referenced_type" : "type-266",
   "self_type" : "type-266",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-267" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<long long>",
   "name" : "android::trait_trivial_dtor<long long>",
   "referenced_type" : "type-268",
   "self_type" : "type-268",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-267" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<long long>",
   "name" : "android::trait_trivial_copy<long long>",
   "referenced_type" : "type-269",
   "self_type" : "type-269",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-267" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<long long>",
   "name" : "android::trait_trivial_move<long long>",
   "referenced_type" : "type-270",
   "self_type" : "type-270",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-267" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIxEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<unsigned long long>",
   "name" : "android::trait_trivial_ctor<unsigned long long>",
   "referenced_type" : "type-271",
   "self_type" : "type-271",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<unsigned long long>",
   "name" : "android::trait_trivial_dtor<unsigned long long>",
   "referenced_type" : "type-272",
   "self_type" : "type-272",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<unsigned long long>",
   "name" : "android::trait_trivial_copy<unsigned long long>",
   "referenced_type" : "type-273",
   "self_type" : "type-273",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<unsigned long long>",
   "name" : "android::trait_trivial_move<unsigned long long>",
   "referenced_type" : "type-274",
   "self_type" : "type-274",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-21" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIyEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<float>",
   "name" : "android::trait_trivial_ctor<float>",
   "referenced_type" : "type-275",
   "self_type" : "type-275",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-276" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<float>",
   "name" : "android::trait_trivial_dtor<float>",
   "referenced_type" : "type-277",
   "self_type" : "type-277",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-276" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<float>",
   "name" : "android::trait_trivial_copy<float>",
   "referenced_type" : "type-278",
   "self_type" : "type-278",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-276" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<float>",
   "name" : "android::trait_trivial_move<float>",
   "referenced_type" : "type-279",
   "self_type" : "type-279",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-276" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIfEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_ctor<double>",
   "name" : "android::trait_trivial_ctor<double>",
   "referenced_type" : "type-280",
   "self_type" : "type-280",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-281" ],
   "unique_id" : "_ZTSN7android18trait_trivial_ctorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_dtor<double>",
   "name" : "android::trait_trivial_dtor<double>",
   "referenced_type" : "type-282",
   "self_type" : "type-282",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-281" ],
   "unique_id" : "_ZTSN7android18trait_trivial_dtorIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_copy<double>",
   "name" : "android::trait_trivial_copy<double>",
   "referenced_type" : "type-283",
   "self_type" : "type-283",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-281" ],
   "unique_id" : "_ZTSN7android18trait_trivial_copyIdEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<double>",
   "name" : "android::trait_trivial_move<double>",
   "referenced_type" : "type-284",
   "self_type" : "type-284",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/TypeHelpers.h",
   "template_args" : [ "type-281" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveIdEE"
  },
  {
   "alignment" : 4,
   "linker_set_key" : "android::ReferenceRenamer",
   "name" : "android::ReferenceRenamer",
   "record_kind" : "class",
   "referenced_type" : "type-306",
   "self_type" : "type-306",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android16ReferenceRenamerE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16ReferenceRenamerE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16ReferenceRenamerclEj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 32,
     "referenced_type" : "type-310"
    }
   ],
   "linker_set_key" : "android::RefBase",
   "name" : "android::RefBase",
   "record_kind" : "class",
   "referenced_type" : "type-308",
   "self_type" : "type-308",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBaseE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android7RefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android7RefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::RefBase::weakref_type",
   "name" : "android::RefBase::weakref_type",
   "record_kind" : "class",
   "referenced_type" : "type-84",
   "self_type" : "type-84",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android7RefBase12weakref_typeE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::ReferenceMover",
   "name" : "android::ReferenceMover",
   "record_kind" : "class",
   "referenced_type" : "type-315",
   "self_type" : "type-315",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/RefBase.h",
   "unique_id" : "_ZTSN7android14ReferenceMoverE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-308"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_death_recipient",
   "name" : "android::hardware::hidl_death_recipient",
   "referenced_type" : "type-95",
   "self_type" : "type-95",
   "size" : 12,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware20hidl_death_recipientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipient11serviceDiedEyRKNS_2wpINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware20hidl_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware20hidl_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-31"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_handle",
   "name" : "android::hardware::hidl_handle",
   "referenced_type" : "type-316",
   "self_type" : "type-316",
   "size" : 16,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_handleE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-35"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_string",
   "name" : "android::hardware::hidl_string",
   "referenced_type" : "type-55",
   "self_type" : "type-55",
   "size" : 16,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_stringE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "referenced_type" : "type-316"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mName",
     "field_offset" : 192,
     "referenced_type" : "type-55"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_memory",
   "name" : "android::hardware::hidl_memory",
   "referenced_type" : "type-319",
   "self_type" : "type-319",
   "size" : 40,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware11hidl_memoryE"
  },
  {
   "alignment" : 8,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-319"
    },
    {
     "is_virtual" : true,
     "referenced_type" : "type-308"
    }
   ],
   "linker_set_key" : "android::hardware::HidlMemory",
   "name" : "android::hardware::HidlMemory",
   "record_kind" : "class",
   "referenced_type" : "type-327",
   "self_type" : "type-327",
   "size" : 56,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware10HidlMemoryE",
   "vtable_components" :
   [
    {
     "component_value" : 48,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : 8,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10HidlMemoryD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -48,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10HidlMemoryE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10HidlMemoryD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-39"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "name" : "android::hardware::hidl_vec<android::hardware::GrantorDescriptor>",
   "referenced_type" : "type-332",
   "self_type" : "type-332",
   "size" : 16,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-41" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_17GrantorDescriptorEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-53"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::hidl_string>",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_string>",
   "referenced_type" : "type-333",
   "self_type" : "type-333",
   "size" : 16,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-55" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_11hidl_stringEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-63"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<android::hardware::hidl_array<unsigned char, 32> >",
   "name" : "android::hardware::hidl_vec<android::hardware::hidl_array<unsigned char, 32> >",
   "referenced_type" : "type-338",
   "self_type" : "type-338",
   "size" : 16,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-65" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-46"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<int>",
   "name" : "android::hardware::hidl_vec<int>",
   "referenced_type" : "type-343",
   "self_type" : "type-343",
   "size" : 16,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-7" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecIiEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-72"
    },
    {
     "access" : "private",
     "field_name" : "mSize",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsBuffer",
     "field_offset" : 96,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_vec<char>",
   "name" : "android::hardware::hidl_vec<char>",
   "referenced_type" : "type-347",
   "self_type" : "type-347",
   "size" : 16,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android8hardware8hidl_vecIcEE"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::hardware::details::std_array<unsigned char, 32>",
   "name" : "android::hardware::details::std_array<unsigned char, 32>",
   "referenced_type" : "type-348",
   "self_type" : "type-348",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN7android8hardware7details9std_arrayIhLj32EJEEE"
  },
  {
   "alignment" : 1,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBuffer",
     "referenced_type" : "type-349"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_array<unsigned char, 32>",
   "name" : "android::hardware::hidl_array<unsigned char, 32>",
   "referenced_type" : "type-65",
   "self_type" : "type-65",
   "size" : 32,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlSupport.h",
   "template_args" : [ "type-15" ],
   "unique_id" : "_ZTSN7android8hardware10hidl_arrayIhLj32EJEEE"
  },
  {
   "alignment" : 2,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMajor",
     "referenced_type" : "type-6"
    },
    {
     "access" : "private",
     "field_name" : "mMinor",
     "field_offset" : 16,
     "referenced_type" : "type-6"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_version",
   "name" : "android::hardware::hidl_version",
   "referenced_type" : "type-351",
   "self_type" : "type-351",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/HidlSupport.h",
   "unique_id" : "_ZTSN7android8hardware12hidl_versionE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "flags",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "fdIndex",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "offset",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "extent",
     "field_offset" : 128,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::hardware::GrantorDescriptor",
   "name" : "android::hardware::GrantorDescriptor",
   "referenced_type" : "type-41",
   "self_type" : "type-41",
   "size" : 24,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/MQDescriptor.h",
   "unique_id" : "_ZTSN7android8hardware17GrantorDescriptorE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mGrantors",
     "referenced_type" : "type-332"
    },
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 128,
     "referenced_type" : "type-43"
    },
    {
     "access" : "private",
     "field_name" : "mQuantum",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    }
   ],
   "linker_set_key" : "android::hardware::MQDescriptor<char, android::hardware::kSynchronizedReadWrite>",
   "name" : "android::hardware::MQDescriptor<char, android::hardware::kSynchronizedReadWrite>",
   "referenced_type" : "type-361",
   "self_type" : "type-361",
   "size" : 32,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/MQDescriptor.h",
   "template_args" : [ "type-8" ],
   "unique_id" : "_ZTSN7android8hardware12MQDescriptorIcLNS0_8MQFlavorE1EEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-220"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mHandle",
     "field_offset" : 32,
     "referenced_type" : "type-45"
    },
    {
     "access" : "private",
     "field_name" : "mOwnsHandle",
     "field_offset" : 64,
     "referenced_type" : "type-17"
    }
   ],
   "linker_set_key" : "android::NativeHandle",
   "name" : "android::NativeHandle",
   "record_kind" : "class",
   "referenced_type" : "type-221",
   "self_type" : "type-221",
   "size" : 12,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/NativeHandle.h",
   "unique_id" : "_ZTSN7android12NativeHandleE"
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "pid",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "ptr",
     "field_offset" : 64,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "arch",
     "field_offset" : 128,
     "referenced_type" : "type-366"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::DebugInfo",
   "name" : "android::hidl::base::V1_0::DebugInfo",
   "referenced_type" : "type-365",
   "self_type" : "type-365",
   "size" : 24,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/types.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_09DebugInfoE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-308"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::IBase",
   "name" : "android::hidl::base::V1_0::IBase",
   "referenced_type" : "type-82",
   "self_type" : "type-82",
   "size" : 12,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/IBase.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_05IBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_05IBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_05IBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-38"
    }
   ],
   "linker_set_key" : "android::String8",
   "name" : "android::String8",
   "record_kind" : "class",
   "referenced_type" : "type-371",
   "self_type" : "type-371",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/String8.h",
   "unique_id" : "_ZTSN7android7String8E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String8>",
   "name" : "android::trait_trivial_move<android::String8>",
   "referenced_type" : "type-378",
   "self_type" : "type-378",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/String8.h",
   "template_args" : [ "type-371" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_7String8EEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mString",
     "referenced_type" : "type-381"
    }
   ],
   "linker_set_key" : "android::String16",
   "name" : "android::String16",
   "record_kind" : "class",
   "referenced_type" : "type-379",
   "self_type" : "type-379",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/String16.h",
   "unique_id" : "_ZTSN7android8String16E"
  },
  {
   "alignment" : 1,
   "linker_set_key" : "android::trait_trivial_move<android::String16>",
   "name" : "android::trait_trivial_move<android::String16>",
   "referenced_type" : "type-389",
   "self_type" : "type-389",
   "size" : 1,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/String16.h",
   "template_args" : [ "type-379" ],
   "unique_id" : "_ZTSN7android18trait_trivial_moveINS_8String16EEE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-308"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder",
   "name" : "android::hardware::IBinder",
   "record_kind" : "class",
   "referenced_type" : "type-142",
   "self_type" : "type-142",
   "size" : 12,
   "source_file" : "/home/abhishek/aosp-q1/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder11linkToDeathERKNS_2spINS1_14DeathRecipientEEEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder13unlinkToDeathERKNS_2wpINS1_14DeathRecipientEEEPvjPS4_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android8hardware7IBinder10findObjectEPKv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinderD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-308"
    }
   ],
   "linker_set_key" : "android::hardware::IBinder::DeathRecipient",
   "name" : "android::hardware::IBinder::DeathRecipient",
   "record_kind" : "class",
   "referenced_type" : "type-104",
   "self_type" : "type-104",
   "size" : 12,
   "source_file" : "/home/abhishek/aosp-q1/system/libhwbinder/include/hwbinder/IBinder.h",
   "unique_id" : "_ZTSN7android8hardware7IBinder14DeathRecipientE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipient10binderDiedERKNS_2wpIS1_EE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware7IBinder14DeathRecipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinder14DeathRecipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware7IBinder14DeathRecipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-142"
    }
   ],
   "fields" :
   [
    {
     "access" : "protected",
     "field_name" : "mSchedPolicy",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "access" : "protected",
     "field_name" : "mSchedPriority",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mExtras",
     "field_offset" : 96,
     "referenced_type" : "type-390"
    },
    {
     "access" : "private",
     "field_name" : "mReserved0",
     "field_offset" : 128,
     "referenced_type" : "type-391"
    }
   ],
   "linker_set_key" : "android::hardware::BHwBinder",
   "name" : "android::hardware::BHwBinder",
   "record_kind" : "class",
   "referenced_type" : "type-112",
   "self_type" : "type-112",
   "size" : 28,
   "source_file" : "/home/abhishek/aosp-q1/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware9BHwBinderE",
   "vtable_components" :
   [
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder10onTransactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware9BHwBinderE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware9BHwBinderD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware9BHwBinderD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-308"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRemote",
     "field_offset" : 32,
     "referenced_type" : "type-393"
    },
    {
     "access" : "private",
     "field_name" : "mRefs",
     "field_offset" : 64,
     "referenced_type" : "type-85"
    },
    {
     "access" : "private",
     "field_name" : "mState",
     "field_offset" : 96,
     "referenced_type" : "type-218"
    }
   ],
   "linker_set_key" : "android::hardware::BpHwRefBase",
   "name" : "android::hardware::BpHwRefBase",
   "record_kind" : "class",
   "referenced_type" : "type-392",
   "self_type" : "type-392",
   "size" : 24,
   "source_file" : "/home/abhishek/aosp-q1/system/libhwbinder/include/hwbinder/Binder.h",
   "unique_id" : "_ZTSN7android8hardware11BpHwRefBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpHwRefBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpHwRefBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpHwRefBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-308"
    }
   ],
   "linker_set_key" : "android::hardware::IInterface",
   "name" : "android::hardware::IInterface",
   "record_kind" : "class",
   "referenced_type" : "type-148",
   "self_type" : "type-148",
   "size" : 12,
   "source_file" : "/home/abhishek/aosp-q1/system/libhwbinder/include/hwbinder/IInterface.h",
   "unique_id" : "_ZTSN7android8hardware10IInterfaceE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware10IInterfaceD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware10IInterface10onAsBinderEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware10IInterfaceE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10IInterfaceD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware10IInterfaceD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-82"
    },
    {
     "referenced_type" : "type-148"
    },
    {
     "referenced_type" : "type-392"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hidl::base::V1_0::IBase>",
   "name" : "android::hardware::BpInterface<android::hidl::base::V1_0::IBase>",
   "record_kind" : "class",
   "referenced_type" : "type-396",
   "self_type" : "type-396",
   "size" : 32,
   "source_file" : "/home/abhishek/aosp-q1/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-82" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_05IBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_05IBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-90"
    },
    {
     "referenced_type" : "type-148"
    },
    {
     "referenced_type" : "type-392"
    }
   ],
   "linker_set_key" : "android::hardware::BpInterface<android::hardware::foobar::V1_0::IFoobar>",
   "name" : "android::hardware::BpInterface<android::hardware::foobar::V1_0::IFoobar>",
   "record_kind" : "class",
   "referenced_type" : "type-397",
   "self_type" : "type-397",
   "size" : 32,
   "source_file" : "/home/abhishek/aosp-q1/system/libhwbinder/include/hwbinder/IInterface.h",
   "template_args" : [ "type-90" ],
   "unique_id" : "_ZTSN7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEEE",
   "vtable_components" :
   [
    {
     "component_value" : 24,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEEE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6foobar4V1_07IFoobar8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEED0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar10getVersionEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEE10onAsBinderEv"
    },
    {
     "component_value" : 20,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEED0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEE10onAsBinderEv"
    },
    {
     "component_value" : 16,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEED0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -16,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEED0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mBufCachePos",
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mBufCache",
     "field_offset" : 32,
     "referenced_type" : "type-401"
    },
    {
     "access" : "private",
     "field_name" : "mError",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mData",
     "field_offset" : 160,
     "referenced_type" : "type-402"
    },
    {
     "access" : "private",
     "field_name" : "mDataSize",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mDataCapacity",
     "field_offset" : 224,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mDataPos",
     "field_offset" : 256,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mObjects",
     "field_offset" : 288,
     "referenced_type" : "type-403"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsSize",
     "field_offset" : 320,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mObjectsCapacity",
     "field_offset" : 352,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mNextObjectHint",
     "field_offset" : 384,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mNumRef",
     "field_offset" : 416,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFdsKnown",
     "field_offset" : 448,
     "referenced_type" : "type-17"
    },
    {
     "access" : "private",
     "field_name" : "mHasFds",
     "field_offset" : 456,
     "referenced_type" : "type-17"
    },
    {
     "access" : "private",
     "field_name" : "mAllowFds",
     "field_offset" : 464,
     "referenced_type" : "type-17"
    },
    {
     "access" : "private",
     "field_name" : "mOwner",
     "field_offset" : 480,
     "referenced_type" : "type-405"
    },
    {
     "access" : "private",
     "field_name" : "mOwnerCookie",
     "field_offset" : 512,
     "referenced_type" : "type-391"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel",
   "name" : "android::hardware::Parcel",
   "record_kind" : "class",
   "referenced_type" : "type-400",
   "self_type" : "type-400",
   "size" : 68,
   "source_file" : "/home/abhishek/aosp-q1/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6ParcelE"
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "index",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "buffer",
     "field_offset" : 32,
     "referenced_type" : "type-21"
    },
    {
     "field_name" : "bufend",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::hardware::Parcel::BufferInfo",
   "name" : "android::hardware::Parcel::BufferInfo",
   "referenced_type" : "type-408",
   "self_type" : "type-408",
   "size" : 20,
   "source_file" : "/home/abhishek/aosp-q1/system/libhwbinder/include/hwbinder/Parcel.h",
   "unique_id" : "_ZTSN7android8hardware6Parcel10BufferInfoE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-112"
    },
    {
     "referenced_type" : "type-74"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 512,
     "referenced_type" : "type-126"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::BnHwBase",
   "name" : "android::hidl::base::V1_0::BnHwBase",
   "referenced_type" : "type-413",
   "self_type" : "type-413",
   "size" : 76,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/BnHwBase.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_08BnHwBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 68,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BnHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BnHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BnHwBase10onTransactEjRKNS_8hardware6ParcelEPS5_jNSt3__18functionIFvRS5_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android4hidl4base4V1_08BnHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android4hidl4base4V1_08BnHwBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -68,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -68,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BnHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_08BnHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_08BnHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-104"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRecipient",
     "field_offset" : 32,
     "referenced_type" : "type-94"
    },
    {
     "access" : "private",
     "field_name" : "mCookie",
     "field_offset" : 96,
     "referenced_type" : "type-21"
    },
    {
     "access" : "private",
     "field_name" : "mBase",
     "field_offset" : 160,
     "referenced_type" : "type-81"
    }
   ],
   "linker_set_key" : "android::hardware::hidl_binder_death_recipient",
   "name" : "android::hardware::hidl_binder_death_recipient",
   "referenced_type" : "type-110",
   "self_type" : "type-110",
   "size" : 36,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/transport/include/hidl/HidlBinderSupport.h",
   "unique_id" : "_ZTSN7android8hardware27hidl_binder_death_recipientE",
   "vtable_components" :
   [
    {
     "component_value" : 28,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware27hidl_binder_death_recipientE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware27hidl_binder_death_recipient10binderDiedERKNS_2wpINS0_7IBinderEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware27hidl_binder_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware27hidl_binder_death_recipientD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -28,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -28,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware27hidl_binder_death_recipientE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware27hidl_binder_death_recipientD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware27hidl_binder_death_recipientD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-418"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-419"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, android::hardware::details::SchedPrio>",
   "name" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, android::hardware::details::SchedPrio>",
   "record_kind" : "class",
   "referenced_type" : "type-417",
   "self_type" : "type-417",
   "size" : 16,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-81", "type-420" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINS_2wpINS_4hidl4base4V1_05IBaseEEENS0_7details9SchedPrioEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-418"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-426"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, bool>",
   "name" : "android::hardware::ConcurrentMap<android::wp<android::hidl::base::V1_0::IBase>, bool>",
   "record_kind" : "class",
   "referenced_type" : "type-425",
   "self_type" : "type-425",
   "size" : 16,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-81", "type-17" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINS_2wpINS_4hidl4base4V1_05IBaseEEEbEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-418"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-430"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<const android::hidl::base::V1_0::IBase *, android::wp<android::hardware::BHwBinder> >",
   "name" : "android::hardware::ConcurrentMap<const android::hidl::base::V1_0::IBase *, android::wp<android::hardware::BHwBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-429",
   "self_type" : "type-429",
   "size" : 16,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-137", "type-111" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapIPKNS_4hidl4base4V1_05IBaseENS_2wpINS0_9BHwBinderEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-418"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-435"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBinder> (void *)> >",
   "name" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBinder> (void *)> >",
   "record_kind" : "class",
   "referenced_type" : "type-434",
   "self_type" : "type-434",
   "size" : 16,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-76", "type-436" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS0_7IBinderEEEPvEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-418"
    },
    {
     "access" : "private",
     "field_name" : "mMap",
     "field_offset" : 32,
     "referenced_type" : "type-441"
    }
   ],
   "linker_set_key" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBase> (void *)> >",
   "name" : "android::hardware::ConcurrentMap<std::basic_string<char, std::char_traits<char>, std::allocator<char> >, std::function<sp<IBase> (void *)> >",
   "record_kind" : "class",
   "referenced_type" : "type-440",
   "self_type" : "type-440",
   "size" : 16,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/transport/include/hidl/ConcurrentMap.h",
   "template_args" : [ "type-76", "type-442" ],
   "unique_id" : "_ZTSN7android8hardware13ConcurrentMapINSt3__112basic_stringIcNS2_11char_traitsIcEENS2_9allocatorIcEEEENS2_8functionIFNS_2spINS_4hidl4base4V1_05IBaseEEEPvEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "sched_policy",
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "prio",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::hardware::details::SchedPrio",
   "name" : "android::hardware::details::SchedPrio",
   "referenced_type" : "type-420",
   "self_type" : "type-420",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/transport/include/hidl/Static.h",
   "unique_id" : "_ZTSN7android8hardware7details9SchedPrioE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mStorage",
     "field_offset" : 32,
     "referenced_type" : "type-391"
    },
    {
     "access" : "private",
     "field_name" : "mCount",
     "field_offset" : 64,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mFlags",
     "field_offset" : 96,
     "referenced_type" : "type-296"
    },
    {
     "access" : "private",
     "field_name" : "mItemSize",
     "field_offset" : 128,
     "referenced_type" : "type-296"
    }
   ],
   "linker_set_key" : "android::VectorImpl",
   "name" : "android::VectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-445",
   "self_type" : "type-445",
   "size" : 20,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android10VectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android10VectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android10VectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-445"
    }
   ],
   "linker_set_key" : "android::SortedVectorImpl",
   "name" : "android::SortedVectorImpl",
   "record_kind" : "class",
   "referenced_type" : "type-448",
   "self_type" : "type-448",
   "size" : 20,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/VectorImpl.h",
   "unique_id" : "_ZTSN7android16SortedVectorImplE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android16SortedVectorImplE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android16SortedVectorImplD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl12do_constructEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl10do_destroyEPvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl7do_copyEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl8do_splatEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl15do_move_forwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android10VectorImpl16do_move_backwardEPvPKvj"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZNK7android16SortedVectorImpl10do_compareEPKvS2_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-448"
    }
   ],
   "linker_set_key" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "name" : "android::SortedVector<android::key_value_pair_t<android::String16, android::sp<android::hardware::IBinder> > >",
   "record_kind" : "class",
   "referenced_type" : "type-449",
   "self_type" : "type-449",
   "size" : 20,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/SortedVector.h",
   "template_args" : [ "type-450" ],
   "unique_id" : "_ZTSN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE16do_move_backwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android12SortedVectorINS_16key_value_pair_tINS_8String16ENS_2spINS_8hardware7IBinderEEEEEE10do_compareEPKvSA_"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "access" : "private",
     "referenced_type" : "type-445"
    }
   ],
   "linker_set_key" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "name" : "android::Vector<android::hardware::ProcessState::handle_entry>",
   "record_kind" : "class",
   "referenced_type" : "type-451",
   "self_type" : "type-451",
   "size" : 20,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/Vector.h",
   "template_args" : [ "type-452" ],
   "unique_id" : "_ZTSN7android6VectorINS_8hardware12ProcessState12handle_entryEEE",
   "vtable_components" :
   [
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6VectorINS_8hardware12ProcessState12handle_entryEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6VectorINS_8hardware12ProcessState12handle_entryEED0Ev"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE12do_constructEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE10do_destroyEPvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE7do_copyEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE8do_splatEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE15do_move_forwardEPvPKvj"
    },
    {
     "mangled_component_name" : "_ZNK7android6VectorINS_8hardware12ProcessState12handle_entryEE16do_move_backwardEPvPKvj"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mVector",
     "referenced_type" : "type-449"
    }
   ],
   "linker_set_key" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "name" : "android::KeyedVector<android::String16, android::sp<android::hardware::IBinder> >",
   "record_kind" : "class",
   "referenced_type" : "type-453",
   "self_type" : "type-453",
   "size" : 20,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/KeyedVector.h",
   "template_args" : [ "type-379", "type-141" ],
   "unique_id" : "_ZTSN7android11KeyedVectorINS_8String16ENS_2spINS_8hardware7IBinderEEEEE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "y",
     "referenced_type" : "type-391"
    },
    {
     "field_name" : "cb",
     "field_offset" : 32,
     "referenced_type" : "type-391"
    },
    {
     "field_name" : "cr",
     "field_offset" : 64,
     "referenced_type" : "type-391"
    },
    {
     "field_name" : "ystride",
     "field_offset" : 96,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "cstride",
     "field_offset" : 128,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "chroma_step",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 192,
     "referenced_type" : "type-466"
    }
   ],
   "linker_set_key" : "android_ycbcr",
   "name" : "android_ycbcr",
   "referenced_type" : "type-465",
   "self_type" : "type-465",
   "size" : 56,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_ycbcr"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "top_left",
     "referenced_type" : "type-402"
    },
    {
     "field_name" : "component",
     "field_offset" : 32,
     "referenced_type" : "type-467"
    },
    {
     "field_name" : "bits_per_component",
     "field_offset" : 64,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "bits_used",
     "field_offset" : 96,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "h_increment",
     "field_offset" : 128,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "v_increment",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "h_subsampling",
     "field_offset" : 192,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "v_subsampling",
     "field_offset" : 224,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android_flex_plane",
   "name" : "android_flex_plane",
   "referenced_type" : "type-468",
   "self_type" : "type-468",
   "size" : 32,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_plane"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "format",
     "referenced_type" : "type-469"
    },
    {
     "field_name" : "num_planes",
     "field_offset" : 32,
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "planes",
     "field_offset" : 64,
     "referenced_type" : "type-471"
    }
   ],
   "linker_set_key" : "android_flex_layout",
   "name" : "android_flex_layout",
   "referenced_type" : "type-470",
   "self_type" : "type-470",
   "size" : 12,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_flex_layout"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "num_points",
     "referenced_type" : "type-2"
    },
    {
     "field_name" : "reserved",
     "field_offset" : 32,
     "referenced_type" : "type-466"
    },
    {
     "field_name" : "xyzc_points",
     "field_offset" : 288,
     "referenced_type" : "type-473"
    }
   ],
   "linker_set_key" : "android_depth_points",
   "name" : "android_depth_points",
   "referenced_type" : "type-472",
   "self_type" : "type-472",
   "size" : 36,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_depth_points"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "x",
     "referenced_type" : "type-276"
    },
    {
     "field_name" : "y",
     "field_offset" : 32,
     "referenced_type" : "type-276"
    }
   ],
   "linker_set_key" : "android_xy_color",
   "name" : "android_xy_color",
   "referenced_type" : "type-474",
   "self_type" : "type-474",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_xy_color"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "displayPrimaryRed",
     "referenced_type" : "type-474"
    },
    {
     "field_name" : "displayPrimaryGreen",
     "field_offset" : 64,
     "referenced_type" : "type-474"
    },
    {
     "field_name" : "displayPrimaryBlue",
     "field_offset" : 128,
     "referenced_type" : "type-474"
    },
    {
     "field_name" : "whitePoint",
     "field_offset" : 192,
     "referenced_type" : "type-474"
    },
    {
     "field_name" : "maxLuminance",
     "field_offset" : 256,
     "referenced_type" : "type-276"
    },
    {
     "field_name" : "minLuminance",
     "field_offset" : 288,
     "referenced_type" : "type-276"
    }
   ],
   "linker_set_key" : "android_smpte2086_metadata",
   "name" : "android_smpte2086_metadata",
   "referenced_type" : "type-475",
   "self_type" : "type-475",
   "size" : 40,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_smpte2086_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "maxContentLightLevel",
     "referenced_type" : "type-276"
    },
    {
     "field_name" : "maxFrameAverageLightLevel",
     "field_offset" : 32,
     "referenced_type" : "type-276"
    }
   ],
   "linker_set_key" : "android_cta861_3_metadata",
   "name" : "android_cta861_3_metadata",
   "referenced_type" : "type-476",
   "self_type" : "type-476",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libsystem/include/system/graphics.h",
   "unique_id" : "android_cta861_3_metadata"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mMutex",
     "referenced_type" : "type-481"
    }
   ],
   "linker_set_key" : "android::Mutex",
   "name" : "android::Mutex",
   "record_kind" : "class",
   "referenced_type" : "type-480",
   "self_type" : "type-480",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5MutexE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-484"
    }
   ],
   "linker_set_key" : "android::Mutex::Autolock",
   "name" : "android::Mutex::Autolock",
   "record_kind" : "class",
   "referenced_type" : "type-483",
   "self_type" : "type-483",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/Mutex.h",
   "unique_id" : "_ZTSN7android5Mutex8AutolockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCond",
     "referenced_type" : "type-487"
    }
   ],
   "linker_set_key" : "android::Condition",
   "name" : "android::Condition",
   "record_kind" : "class",
   "referenced_type" : "type-486",
   "self_type" : "type-486",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/Condition.h",
   "unique_id" : "_ZTSN7android9ConditionE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mRWLock",
     "referenced_type" : "type-491"
    }
   ],
   "linker_set_key" : "android::RWLock",
   "name" : "android::RWLock",
   "record_kind" : "class",
   "referenced_type" : "type-490",
   "self_type" : "type-490",
   "size" : 40,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-494"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoRLock",
   "name" : "android::RWLock::AutoRLock",
   "record_kind" : "class",
   "referenced_type" : "type-493",
   "self_type" : "type-493",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoRLockE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mLock",
     "referenced_type" : "type-494"
    }
   ],
   "linker_set_key" : "android::RWLock::AutoWLock",
   "name" : "android::RWLock::AutoWLock",
   "record_kind" : "class",
   "referenced_type" : "type-496",
   "self_type" : "type-496",
   "size" : 4,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/RWLock.h",
   "unique_id" : "_ZTSN7android6RWLock9AutoWLockE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-308"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mCanCallJava",
     "field_offset" : 32,
     "referenced_type" : "type-285"
    },
    {
     "access" : "private",
     "field_name" : "mThread",
     "field_offset" : 64,
     "referenced_type" : "type-391"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 96,
     "referenced_type" : "type-480"
    },
    {
     "access" : "private",
     "field_name" : "mThreadExitedCondition",
     "field_offset" : 128,
     "referenced_type" : "type-486"
    },
    {
     "access" : "private",
     "field_name" : "mStatus",
     "field_offset" : 160,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mExitPending",
     "field_offset" : 192,
     "referenced_type" : "type-498"
    },
    {
     "access" : "private",
     "field_name" : "mRunning",
     "field_offset" : 200,
     "referenced_type" : "type-498"
    },
    {
     "access" : "private",
     "field_name" : "mHoldSelf",
     "field_offset" : 224,
     "referenced_type" : "type-162"
    },
    {
     "access" : "private",
     "field_name" : "mTid",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    }
   ],
   "linker_set_key" : "android::Thread",
   "name" : "android::Thread",
   "record_kind" : "class",
   "referenced_type" : "type-163",
   "self_type" : "type-163",
   "size" : 44,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/Thread.h",
   "unique_id" : "_ZTSN7android6ThreadE",
   "vtable_components" :
   [
    {
     "component_value" : 36,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread3runEPKcij"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread11requestExitEv"
    },
    {
     "mangled_component_name" : "_ZN7android6Thread10readyToRunEv"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android6Thread10threadLoopEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -36,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android6ThreadE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android6ThreadD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "is_virtual" : true,
     "referenced_type" : "type-308"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mDriverFD",
     "field_offset" : 32,
     "referenced_type" : "type-7"
    },
    {
     "access" : "private",
     "field_name" : "mVMStart",
     "field_offset" : 64,
     "referenced_type" : "type-391"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountLock",
     "field_offset" : 96,
     "referenced_type" : "type-481"
    },
    {
     "access" : "private",
     "field_name" : "mThreadCountDecrement",
     "field_offset" : 128,
     "referenced_type" : "type-487"
    },
    {
     "access" : "private",
     "field_name" : "mExecutingThreadsCount",
     "field_offset" : 160,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mMaxThreads",
     "field_offset" : 192,
     "referenced_type" : "type-2"
    },
    {
     "access" : "private",
     "field_name" : "mStarvationStartTimeMs",
     "field_offset" : 224,
     "referenced_type" : "type-267"
    },
    {
     "access" : "private",
     "field_name" : "mLock",
     "field_offset" : 288,
     "referenced_type" : "type-480"
    },
    {
     "access" : "private",
     "field_name" : "mHandleToObject",
     "field_offset" : 320,
     "referenced_type" : "type-451"
    },
    {
     "access" : "private",
     "field_name" : "mManagesContexts",
     "field_offset" : 480,
     "referenced_type" : "type-17"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextCheckFunc",
     "field_offset" : 512,
     "referenced_type" : "type-500"
    },
    {
     "access" : "private",
     "field_name" : "mBinderContextUserData",
     "field_offset" : 544,
     "referenced_type" : "type-391"
    },
    {
     "access" : "private",
     "field_name" : "mContexts",
     "field_offset" : 576,
     "referenced_type" : "type-453"
    },
    {
     "access" : "private",
     "field_name" : "mRootDir",
     "field_offset" : 736,
     "referenced_type" : "type-371"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolStarted",
     "field_offset" : 768,
     "referenced_type" : "type-17"
    },
    {
     "access" : "private",
     "field_name" : "mSpawnThreadOnStart",
     "field_offset" : 776,
     "referenced_type" : "type-17"
    },
    {
     "access" : "private",
     "field_name" : "mThreadPoolSeq",
     "field_offset" : 800,
     "referenced_type" : "type-501"
    },
    {
     "access" : "private",
     "field_name" : "mMmapSize",
     "field_offset" : 832,
     "referenced_type" : "type-296"
    },
    {
     "access" : "private",
     "field_name" : "mCallRestriction",
     "field_offset" : 864,
     "referenced_type" : "type-502"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState",
   "name" : "android::hardware::ProcessState",
   "record_kind" : "class",
   "referenced_type" : "type-151",
   "self_type" : "type-151",
   "size" : 120,
   "source_file" : "/home/abhishek/aosp-q1/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessStateE",
   "vtable_components" :
   [
    {
     "component_value" : 112,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware12ProcessStateD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -112,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -112,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware12ProcessStateE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware12ProcessStateD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware12ProcessStateD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "access" : "private",
   "alignment" : 4,
   "fields" :
   [
    {
     "field_name" : "binder",
     "referenced_type" : "type-143"
    },
    {
     "field_name" : "refs",
     "field_offset" : 32,
     "referenced_type" : "type-85"
    }
   ],
   "linker_set_key" : "android::hardware::ProcessState::handle_entry",
   "name" : "android::hardware::ProcessState::handle_entry",
   "referenced_type" : "type-452",
   "self_type" : "type-452",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhwbinder/include/hwbinder/ProcessState.h",
   "unique_id" : "_ZTSN7android8hardware12ProcessState12handle_entryE"
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mTag",
     "referenced_type" : "type-21"
    }
   ],
   "linker_set_key" : "android::ScopedTrace",
   "name" : "android::ScopedTrace",
   "record_kind" : "class",
   "referenced_type" : "type-503",
   "self_type" : "type-503",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/core/libutils/include/utils/Trace.h",
   "unique_id" : "_ZTSN7android11ScopedTraceE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "android::hidl::manager::V1_0::IServiceNotification",
   "name" : "android::hidl::manager::V1_0::IServiceNotification",
   "referenced_type" : "type-166",
   "self_type" : "type-166",
   "size" : 12,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceNotification.h",
   "unique_id" : "_ZTSN7android4hidl7manager4V1_020IServiceNotificationE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_020IServiceNotification8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_020IServiceNotification14onRegistrationERKNS_8hardware11hidl_stringES7_b"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_020IServiceNotificationE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_020IServiceNotificationD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "android::hidl::manager::V1_0::IServiceManager",
   "name" : "android::hidl::manager::V1_0::IServiceManager",
   "referenced_type" : "type-121",
   "self_type" : "type-121",
   "size" : 12,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceManager.h",
   "unique_id" : "_ZTSN7android4hidl7manager4V1_015IServiceManagerE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_015IServiceManagerE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl7manager4V1_015IServiceManager8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager12getDebugInfoENSt3__18functionIFvRKNS0_4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManagerD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager3getERKNS_8hardware11hidl_stringES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager3addERKNS_8hardware11hidl_stringERKNS_2spINS0_4base4V1_05IBaseEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager12getTransportERKNS_8hardware11hidl_stringES7_"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager4listENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager15listByInterfaceERKNS_8hardware11hidl_stringENSt3__18functionIFvRKNS4_8hidl_vecIS5_EEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager24registerForNotificationsERKNS_8hardware11hidl_stringES7_RKNS_2spINS2_20IServiceNotificationEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager9debugDumpENSt3__18functionIFvRKNS_8hardware8hidl_vecINS3_17InstanceDebugInfoEEEEEE"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android4hidl7manager4V1_015IServiceManager25registerPassthroughClientERKNS_8hardware11hidl_stringES7_"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl7manager4V1_015IServiceManagerE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_015IServiceManagerD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl7manager4V1_015IServiceManagerD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 8,
   "fields" :
   [
    {
     "field_name" : "interfaceName",
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "instanceName",
     "field_offset" : 128,
     "referenced_type" : "type-55"
    },
    {
     "field_name" : "pid",
     "field_offset" : 256,
     "referenced_type" : "type-7"
    },
    {
     "field_name" : "clientPids",
     "field_offset" : 320,
     "referenced_type" : "type-343"
    },
    {
     "field_name" : "arch",
     "field_offset" : 448,
     "referenced_type" : "type-366"
    }
   ],
   "linker_set_key" : "android::hidl::manager::V1_0::IServiceManager::InstanceDebugInfo",
   "name" : "android::hidl::manager::V1_0::IServiceManager::InstanceDebugInfo",
   "referenced_type" : "type-509",
   "self_type" : "type-509",
   "size" : 64,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/system/libhidl/transport/manager/1.0/android.hidl.manager@1.0_genc++_headers/gen/android/hidl/manager/1.0/IServiceManager.h",
   "unique_id" : "_ZTSN7android4hidl7manager4V1_015IServiceManager17InstanceDebugInfoE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-82"
    }
   ],
   "linker_set_key" : "android::hardware::foobar::V1_0::IFoobar",
   "name" : "android::hardware::foobar::V1_0::IFoobar",
   "referenced_type" : "type-90",
   "self_type" : "type-90",
   "size" : 12,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/hardware/interfaces/foobar/1.0/android.hardware.foobar@1.0_genc++_headers/gen/android/hardware/foobar/1.0/IFoobar.h",
   "unique_id" : "_ZTSN7android8hardware6foobar4V1_07IFoobarE",
   "vtable_components" :
   [
    {
     "component_value" : 4,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6foobar4V1_07IFoobarE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6foobar4V1_07IFoobar8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobarD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobarD0Ev"
    },
    {
     "is_pure" : true,
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_07IFoobar10getVersionEv"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6foobar4V1_07IFoobarE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6foobar4V1_07IFoobarD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6foobar4V1_07IFoobarD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-396"
    },
    {
     "referenced_type" : "type-74"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-418"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-527"
    }
   ],
   "linker_set_key" : "android::hidl::base::V1_0::BpHwBase",
   "name" : "android::hidl::base::V1_0::BpHwBase",
   "referenced_type" : "type-526",
   "self_type" : "type-526",
   "size" : 92,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/system/libhidl/transport/base/1.0/android.hidl.base@1.0_genc++_headers/gen/android/hidl/base/1.0/BpHwBase.h",
   "unique_id" : "_ZTSN7android4hidl4base4V1_08BpHwBaseE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "mangled_component_name" : "_ZNK7android4hidl4base4V1_08BpHwBase8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase14interfaceChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase5debugERKNS_8hardware11hidl_handleERKNS4_8hidl_vecINS4_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase19interfaceDescriptorENSt3__18functionIFvRKNS_8hardware11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase12getHashChainENSt3__18functionIFvRKNS_8hardware8hidl_vecINS6_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase11linkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase12getDebugInfoENSt3__18functionIFvRKNS2_9DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBase13unlinkToDeathERKNS_2spINS_8hardware20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS_4hidl4base4V1_05IBaseEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android4hidl4base4V1_08BpHwBaseE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_08BpHwBaseD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android4hidl4base4V1_08BpHwBaseD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-397"
    },
    {
     "referenced_type" : "type-74"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mMutex",
     "field_offset" : 544,
     "referenced_type" : "type-418"
    },
    {
     "access" : "private",
     "field_name" : "_hidl_mDeathRecipients",
     "field_offset" : 576,
     "referenced_type" : "type-527"
    }
   ],
   "linker_set_key" : "android::hardware::foobar::V1_0::BpHwFoobar",
   "name" : "android::hardware::foobar::V1_0::BpHwFoobar",
   "referenced_type" : "type-132",
   "self_type" : "type-132",
   "size" : 92,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/hardware/interfaces/foobar/1.0/android.hardware.foobar@1.0_genc++_headers/gen/android/hardware/foobar/1.0/BpHwFoobar.h",
   "unique_id" : "_ZTSN7android8hardware6foobar4V1_010BpHwFoobarE",
   "vtable_components" :
   [
    {
     "component_value" : 84,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6foobar4V1_010BpHwFoobarE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6foobar4V1_010BpHwFoobar8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BpHwFoobar14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BpHwFoobar5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BpHwFoobar19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BpHwFoobar12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BpHwFoobar21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BpHwFoobar11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BpHwFoobar4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BpHwFoobar12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BpHwFoobar21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BpHwFoobar13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BpHwFoobarD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BpHwFoobarD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BpHwFoobar10getVersionEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEE10onAsBinderEv"
    },
    {
     "component_value" : 80,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6foobar4V1_010BpHwFoobarE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6foobar4V1_010BpHwFoobarD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6foobar4V1_010BpHwFoobarD0Ev"
    },
    {
     "mangled_component_name" : "_ZThn4_N7android8hardware11BpInterfaceINS0_6foobar4V1_07IFoobarEE10onAsBinderEv"
    },
    {
     "component_value" : 76,
     "kind" : "vbase_offset"
    },
    {
     "component_value" : -8,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6foobar4V1_010BpHwFoobarE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6foobar4V1_010BpHwFoobarD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn8_N7android8hardware6foobar4V1_010BpHwFoobarD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "component_value" : -24,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6foobar4V1_010BpHwFoobarE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6foobar4V1_010BpHwFoobarD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn24_N7android8hardware6foobar4V1_010BpHwFoobarD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -76,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -84,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6foobar4V1_010BpHwFoobarE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6foobar4V1_010BpHwFoobarD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6foobar4V1_010BpHwFoobarD0Ev"
    },
    {
     "mangled_component_name" : "_ZTv0_n16_N7android8hardware11BpHwRefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZTv0_n20_N7android8hardware11BpHwRefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZTv0_n24_N7android8hardware11BpHwRefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-413"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "_hidl_mImpl",
     "field_offset" : 544,
     "referenced_type" : "type-89"
    }
   ],
   "linker_set_key" : "android::hardware::foobar::V1_0::BnHwFoobar",
   "name" : "android::hardware::foobar::V1_0::BnHwFoobar",
   "referenced_type" : "type-115",
   "self_type" : "type-115",
   "size" : 80,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/hardware/interfaces/foobar/1.0/android.hardware.foobar@1.0_genc++_headers/gen/android/hardware/foobar/1.0/BnHwFoobar.h",
   "unique_id" : "_ZTSN7android8hardware6foobar4V1_010BnHwFoobarE",
   "vtable_components" :
   [
    {
     "component_value" : 72,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6foobar4V1_010BnHwFoobarE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder8transactEjRKNS0_6ParcelEPS2_jNSt3__18functionIFvRS2_EEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11linkToDeathERKNS_2spINS0_7IBinder14DeathRecipientEEEPvj"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder13unlinkToDeathERKNS_2wpINS0_7IBinder14DeathRecipientEEEPvjPS5_"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware7IBinder13checkSubclassEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12attachObjectEPKvPvS4_PFvS3_S4_S4_E"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware9BHwBinder10findObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder12detachObjectEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware9BHwBinder11localBinderEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware7IBinder12remoteBinderEv"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BnHwFoobarD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BnHwFoobarD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_010BnHwFoobar10onTransactEjRKNS0_6ParcelEPS4_jNSt3__18functionIFvRS4_EEE"
    },
    {
     "component_value" : -20,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6foobar4V1_010BnHwFoobarE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6foobar4V1_010BnHwFoobarD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn20_N7android8hardware6foobar4V1_010BnHwFoobarD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -72,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6foobar4V1_010BnHwFoobarE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6foobar4V1_010BnHwFoobarD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6foobar4V1_010BnHwFoobarD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase20onIncStrongAttemptedEjPKv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase13onLastWeakRefEPKv"
    }
   ]
  },
  {
   "alignment" : 4,
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mQueue",
     "referenced_type" : "type-534"
    }
   ],
   "linker_set_key" : "android::hardware::details::TaskRunner",
   "name" : "android::hardware::details::TaskRunner",
   "record_kind" : "class",
   "referenced_type" : "type-533",
   "self_type" : "type-533",
   "size" : 8,
   "source_file" : "/home/abhishek/aosp-q1/system/libhidl/base/include/hidl/TaskRunner.h",
   "unique_id" : "_ZTSN7android8hardware7details10TaskRunnerE"
  },
  {
   "alignment" : 4,
   "base_specifiers" :
   [
    {
     "referenced_type" : "type-90"
    },
    {
     "referenced_type" : "type-74"
    }
   ],
   "fields" :
   [
    {
     "access" : "private",
     "field_name" : "mImpl",
     "field_offset" : 384,
     "referenced_type" : "type-87"
    },
    {
     "access" : "private",
     "field_name" : "mOnewayQueue",
     "field_offset" : 416,
     "referenced_type" : "type-533"
    }
   ],
   "linker_set_key" : "android::hardware::foobar::V1_0::BsFoobar",
   "name" : "android::hardware::foobar::V1_0::BsFoobar",
   "referenced_type" : "type-130",
   "self_type" : "type-130",
   "size" : 68,
   "source_file" : "/home/abhishek/aosp-q1/out/soong/.intermediates/hardware/interfaces/foobar/1.0/android.hardware.foobar@1.0_genc++_headers/gen/android/hardware/foobar/1.0/BsFoobar.h",
   "unique_id" : "_ZTSN7android8hardware6foobar4V1_08BsFoobarE",
   "vtable_components" :
   [
    {
     "component_value" : 60,
     "kind" : "vbase_offset"
    },
    {
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6foobar4V1_08BsFoobarE"
    },
    {
     "mangled_component_name" : "_ZNK7android8hardware6foobar4V1_07IFoobar8isRemoteEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_08BsFoobar14interfaceChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_11hidl_stringEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_08BsFoobar5debugERKNS0_11hidl_handleERKNS0_8hidl_vecINS0_11hidl_stringEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_08BsFoobar19interfaceDescriptorENSt3__18functionIFvRKNS0_11hidl_stringEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_08BsFoobar12getHashChainENSt3__18functionIFvRKNS0_8hidl_vecINS0_10hidl_arrayIhLj32EJEEEEEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_08BsFoobar21setHALInstrumentationEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_08BsFoobar11linkToDeathERKNS_2spINS0_20hidl_death_recipientEEEy"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_08BsFoobar4pingEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_08BsFoobar12getDebugInfoENSt3__18functionIFvRKNS_4hidl4base4V1_09DebugInfoEEEE"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_08BsFoobar21notifySyspropsChangedEv"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_08BsFoobar13unlinkToDeathERKNS_2spINS0_20hidl_death_recipientEEE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_08BsFoobarD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_08BsFoobarD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android8hardware6foobar4V1_08BsFoobar10getVersionEv"
    },
    {
     "component_value" : -4,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6foobar4V1_08BsFoobarE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6foobar4V1_08BsFoobarD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZThn4_N7android8hardware6foobar4V1_08BsFoobarD0Ev"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "vcall_offset"
    },
    {
     "component_value" : -60,
     "kind" : "offset_to_top"
    },
    {
     "kind" : "rtti",
     "mangled_component_name" : "_ZTIN7android8hardware6foobar4V1_08BsFoobarE"
    },
    {
     "kind" : "complete_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6foobar4V1_08BsFoobarD1Ev"
    },
    {
     "kind" : "deleting_dtor_pointer",
     "mangled_component_name" : "_ZTv0_n12_N7android8hardware6foobar4V1_08BsFoobarD0Ev"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase10onFirstRefEv"
    },
    {
     "mangled_component_name" : "_ZN7android7RefBase15onLastStrongRefEPKv"
    },
    {
